[
  {
    "_id": {
      "$oid": "660572f3ac0b7c595845d940"
    },
    "image": "1711633139345-sport1.jpg",
    "title": "Polsci North Commences Its 10th Diplomatic Ball",
    "content": "The AB Political Science - North commenced its 10th Diplomatic Ball with a theme, “Vin D'honneur: A Reception to Flourish Camaraderie Among Diplomats” yesterday, December 3, 2023, at University of Caloocan City Congressional Extension Campus. The event aims to pave the way for PolSci students to have international understanding and bring them to the art of fostering global connections.",
    "author": "",
    "types": "News",
    "categories": "Politics",
    "createdAt": "Mon Apr 1 2024 11:17:40 GMT+0800 (Philippine Standard Time)",
    "__v": 0
  },
  {
    "_id": {
      "$oid": "6605733aac0b7c595845d942"
    },
    "image": "1711633210343-politics1.png",
    "title": "BSKE 2023: Barangay at Kabataan Kabilang Ka Dito",
    "content": "Today, October 30, we will exercise our fundamental right to elect our future leaders in the eagerly anticipated Barangay and Sangguniang Kabataan elections, an event that profoundly influences the trajectory of our local community's future. The University of Caloocan City's Supreme Student Council earnestly urges our fellow Yusisistas to be deliberate in selecting our leaders, whose attributes emphasize the welfare of our communities and the aspirations of our youth. Remember that each vote cast represents a measured stride towards a progressive nation.",
    "author": "",
    "types": "News",
    "categories": "Politics",
    "createdAt": "Mon Apr 1 2024 11:17:40 GMT+0800 (Philippine Standard Time)",
    "__v": 0
  },
  {
    "_id": {
      "$oid": "66057387ac0b7c595845d944"
    },
    "image": "1711633287736-health1.png",
    "title": "Psychology Society Conducts Its Annual Psychology Week",
    "content": "The Psychology Week, with the theme “That Shore Up Above: Mental Wellness in Deep Breaths and Calm Water” which was held every year to honor Mental Health Month, wrapped today, October 28, at the Congressional Extension Campus Covered Court. After three years of commemorating this annual event online due to the impending threat of COVID 19 pandemic, Psych Week is returning in 2023, putting the spotlight on the significance of mental well-being and highlighting the need to break down the stigma around disorders associated with mental illness. This annual event, which runs from October 23 to 28, gained immense momentum in less than a week and has become a platform for engaging booths, random activities, and art galleries that serve as an advocate to remind all UCCians that having fun is essential despite academic stress. Psych Week was an initiative conducted by Psychology Society with the support of Psychology Students in order to raise awareness about the value of mental health, encourage discussions, and promote access to services for individuals who needed support. All psychology students gathered in the Covered Court at the end of this long-week event to wrap up and celebrate what they had accomplished by applauding themselves for their unwavering efforts. The final event includes intermission numbers by Freshmen to Juniors, a BSAIS short film, and a Team Building carried out by Psychology 3-C.",
    "author": "",
    "types": "News",
    "categories": "Entertainment",
    "createdAt": "Mon Apr 1 2024 11:17:40 GMT+0800 (Philippine Standard Time)",
    "__v": 0
  },
  {
    "_id": {
      "$oid": "660573d7ac0b7c595845d946"
    },
    "image": "1711633367263-enter1.png",
    "title": "Dthim Expo Features Diverse Cultures Of Various Countries In An Engrossing Event",
    "content": "The Department of Tourism and Hospitality Industry Management (DTHIM) featured diverse cultures through their expo with a theme of, \"A Celebration of Diversity Recognizing Beyond Borders: Tourism and Hospitality Exploration\" yesterday, October 24 at the University of Caloocan City - Congressional Campus. The event was participated by students from both Bachelor of Science in Tourism Management (BSTM) and Bachelor of Science in Hospitality Management (BSHM). Different booths that displayed the vibrant cultures of a few Asian nations were exhibited by Hospitality Management students. Tourism Management students competed in the event by utilizing their travel service abilities in promoting tour packages about several countries. It also included other forms of competition that challenged the skills required in tourism and hospitality industries. The exhibition was primarily facilitated by the Event Management Class 2023 (EMC 2023) of Tourism and Hospitality Management. In addition to the program, the coronation night for the Mr. and Ms. DTHIM 2023 also took place immediately after the former.",
    "author": "",
    "types": "News",
    "categories": "Education",
    "createdAt": "Mon Apr 1 2024 11:17:40 GMT+0800 (Philippine Standard Time)",
    "__v": 0
  },
  {
    "_id": {
      "$oid": "6605744dac0b7c595845d948"
    },
    "image": "1711633485065-edu1.jpg",
    "title": "North Holds Its Annual Psych Week Fair 2023",
    "content": "North dives into Mental Health Awareness Month giving life to the theme, “Mental health is a universal human right”, today October 23, 2023 at UCC - Congressional Campus, as they celebrate Psych Week Fair 2023 entitled “That Shore Up Above: Mental Wellness in Deep Breaths and Calm Waters”. The event started with a warm greetings from Psychology Society's President, Rea Moran, followed by a powerful speech delivered by Guidance Counsellor and the Peer Counseling Club Adviser, Ms. Marjorie Tiu, giving importance to mental health awareness for today's generation.“We should treat our mental health as same as our physical health,” she said.  The Psych Week Fair 2023 continued its celebration as different booths opened for all programs, in relation to Mental Health Awareness Month.",
    "author": "",
    "types": "Events",
    "categories": "Education",
    "status": "Ongoing",
    "createdAt": "Mon Apr 1 2024 11:17:40 GMT+0800 (Philippine Standard Time)",
    "__v": 0
  },
  {
    "_id": {
      "$oid": "660574afac0b7c595845d94a"
    },
    "image": "1711633583773-sport2.png",
    "title": "Alert Projects Another Deed Of Compassion Through Their 2nd Bloodletting Event",
    "content": "The University of Caloocan City's Advanced Lifesavers and Emergency Response Team (UCC-ALERT) demonstrated another act of compassion as they accomplished their 2nd Annual Bloodletting Event titled as, “Blood Letting Activity: Type mo ba ako? Kasi type kita!,” today, October 17 at the UCC-Congressional Campus. 48 bags of donated blood were accumulated from the 71 participants of the event. On the other hand, some of the attendees were pronounced not eligible to donate. The organization was able to partner with the National Kidney Transplant Institute, to which they would be allocating the blood collected.  It was also sponsored by the UCC's Psychology Society (UCC-Psych Soc) and UCC's Supreme Student Council (UCC-SSC). The preparation of the event was supervised by the Committee on Special Project of ALERT, the principal facilitator of the project.",
    "author": "",
    "types": "Events",
    "categories": "Health",
    "status": "Done",
    "createdAt": "Mon Apr 1 2024 11:17:40 GMT+0800 (Philippine Standard Time)",
    "__v": 0
  }
]
